<?php
$x1 = 'this is string';
$x2 = 0.123;
$x3 =  true;
$x4 = 245;
$x5 = [1, 2, 3];
$x6 = 23;
$var = 69;
echo 'string is: ';
var_dump($x1);
/******************/
echo 'float is: ';
var_dump($x2);
/******************/
echo 'boolean is: ';
var_dump($x3);
/******************/
echo 'integer is: ';
var_dump($x4);
/******************/
echo 'array is: ';
var_dump($x5);
/******************/
echo 'integer is: ';
echo gettype($x6);
/******************/
echo is_int($var); // покаже 1, що означає твердження ПРАВДИВЕ
echo is_string($var); // браузер нічого не відобразить, бо твердження ХИБНЕ
/******************/
// вивести тип кожного виразу(перевірити тип виразу) через функцію
//правила перетворення типів даних

